In [12]:
import pymysql
import pandas as pd
import numpy as np
from sqlalchemy import create_engine
from getpass import getpass

In [8]:
password = getpass()

········

In [21]:
# Create engine
engine = create_engine('mysql+pymysql://root:'+password+'@localhost/sakila')

Notes:
<br> 1) The password should be outside the strings quotes (because it is a variable)
<br> 2) localhost by itself could not work, probably try with @localhost:3306
<br> 3) remember that when using the sever in your computer the username may be root.

In [24]:
# Create test query
test_query = '''select * from actor'''

In [25]:
pd.read_sql(test_query, engine)

     actor_id first_name     last_name         last_update
0           1   PENELOPE       GUINESS 2006-02-15 10:34:33
1           2       NICK      WAHLBERG 2006-02-15 10:34:33
2           3         ED         CHASE 2006-02-15 10:34:33
3           4   JENNIFER         DAVIS 2006-02-15 10:34:33
4           5     JOHNNY  LOLLOBRIGIDA 2006-02-15 10:34:33
..        ...        ...           ...                 ...
195       196       BELA        WALKEN 2006-02-15 10:34:33
196       197      REESE          WEST 2006-02-15 10:34:33
197       198       MARY        KEITEL 2006-02-15 10:34:33
198       199      JULIA       FAWCETT 2006-02-15 10:34:33
199       200      THORA        TEMPLE 2006-02-15 10:34:33

[200 rows x 4 columns]

In order to optimize our inventory, we would like to know which films will be rented next month and we are asked to create a model to predict it.

### Instructions

1. Create a query or queries to extract the information you think may be relevant for building the prediction model. It should include some film features and some rental features.
2. Read the data into a Pandas dataframe.
3. Analyze extracted features and transform them. You may need to encode some categorical variables, or scale numerical variables.
4. Create a query to get the list of films and a boolean indicating if it was rented last month. This would be our target variable.
5. Create a logistic regression model to predict this variable from the cleaned data.
6. Evaluate the results.

#### 1) Select the target

In [ ]:
1) So the first